"""
Напишіть програму, яка виводить на екран результат від 0.0 до 1.0. 
Якщо результат за межами діапазону, має видавати помилку. 
Якщо результат від 0.0 до 1.0, виведіть оцінку відповідно до таблиці нижче:

Оцінка

>= 0.9 A
>= 0.8 B
>= 0.7 C
>= 0.6 D
< 0.6 F

Якщо користувач введе значення поза діапазоном, програма має видати помилку і завершитися. 
Для тестування зазначте результат 0.85.
"""

score = float(input("Enter score: "))
if score < 0.0:
     print("wrong number")
     exit()
if score > 1.0:
    print("wrong number")
    exit()
if score >= 0.9:
    print("A")
elif score >= 0.8:
    print("B")
elif score >= 0.7:
    print("C")
elif score >= 0.6:
    print("D")
elif score < 0.6:
    print("F")