"""
Напишіть програму, яка обчислить номінальну заробітну плату, запитавши кількість робочих годин і ставку на годину у користувача. 
Сплачуйте стандартну ставку за 40 робочих годин та 1.5-кратну ставку на годину за години, які він відпрацював понад 40 годин. 
Для тестування використовуйте 45 годин та ставку 10.50 за годину (оплата має бути 498.75). 
Ви маєте застосувати input для читання рядка і float() для перетворення рядка на число. 
Не зважайте на можливі помилки при введенні даних – вважаємо, що користувач правильно вводить дані.
"""

hrs = input("Enter Hours:")
h = float(hrs)
r = input('Enter rate:')
rate = float(r)
pay = 0
if h <= 40:
    pay = h * rate
    print(pay)
elif h > 40 :
    print(40 * rate + ((h - 40) * (rate * 1.5)))
